Запросы.ПростоКоннектор/src/Catalogs/Коннектор_СвойстваКонструктора/Коннектор_СвойстваКонструктора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Коннектор_СвойстваКонструктора</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ПравилаВыгрузкиДаннах</owners>
  <owners>Catalog.ПравилаЗагрузкиДанных</owners>
  <attributes>
    <name>ЭтоМассив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПравилЗаполненияСвойства</name>
    <type>
      <types>EnumRef.Коннектор_ВариантыПравилЗаполненияСвойствКонструктора</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеНаВстроенномЯзыке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Запросы.ПростоКоннектор/src/Enums/Коннектор_ВариантыПравилЗаполненияСвойствКонструктора/Коннектор_ВариантыПравилЗаполненияСвойствКонструктора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Коннектор_ВариантыПравилЗаполненияСвойствКонструктора</name>
  <enumValues>
    <name>РеквизитОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ВыражениеНаВстроенномЯзыке</name>
  </enumValues>
  <enumValues>
    <name>НеЗаполнять</name>
    <comment>Используем, если есть подчиненные элементы</comment>
  </enumValues>
</mdclass:Enum>

Запросы.ПростоКоннектор/src/Catalogs/Коннектор_СвойстваКонструктора/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ВариантПравилЗаполненияСвойства = Перечисления.Коннектор_ВариантыПравилЗаполненияСвойствКонструктора.РеквизитОбъекта Тогда
		ВыражениеНаВстроенномЯзыке = "";
	ИначеЕсли ВариантПравилЗаполненияСвойства = Перечисления.Коннектор_ВариантыПравилЗаполненияСвойствКонструктора.ВыражениеНаВстроенномЯзыке Тогда
		РеквизитИС = "";
	ИначеЕсли ВариантПравилЗаполненияСвойства = Перечисления.Коннектор_ВариантыПравилЗаполненияСвойствКонструктора.НеЗаполнять Тогда
		РеквизитИС = "";
		ВыражениеНаВстроенномЯзыке = "";
		ЭтоМассив = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не Родитель.Пустая() Тогда
		ВариантПравилРодителя = Родитель.ВариантПравилЗаполненияСвойства;
		ВариантНеЗаполнять = Перечисления.Коннектор_ВариантыПравилЗаполненияСвойствКонструктора.НеЗаполнять;
		Если ВариантПравилРодителя <> ВариантНеЗаполнять Тогда
			Справочники.Коннектор_СвойстваКонструктора.ИзменитьПравилоСвойстваКонструктора(Родитель, ВариантНеЗаполнять);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
